#include "pair.hpp"
#include <iostream>
/*
В тази задача ще работим с наредени двоики от елементи, като наредена двойка ще дефинираме като два елементи, които не са задължително еднотипни. Искаме да разполагаме със следните видове наредени двойки:

Tupels

Функции add, mult, sub, със стандартно значение за събериане, умножение и изваждане на наредени двойки поелементно.
Функции <=, >=, <, >, == със стандартното им значение за почленно сравняване на наредени двойки.
Функция display, която принтира наредената двойка във формат -> (val1, val2).
Направете специализация на функцията display, за тип <char*, char*>, така че ако val1 е префикс на val2 или val2 е суфикс на val1, то да се запиша само по големият стринг от двата, да се наслоят един върху друг.
Напишете специализации на сравнителните операции от тип int*, като сравните поелементно елементите на масивите едни с други.
*/

int* even()
{
    int* a = new int[10];

    for (int i = 0; i < 10; i++)
    {
        a[i] = i * 2;
    }
    
    return a;
}

int prime() { return 42; }

int main(){
    pair<int,int> a1 = {1,1};
    pair<const char*, const char*> a2 = { "abc", "c"};

    display(a2,std::cout);
    std::cout << "\n";

    l_pair<int*, int> p;
    p.f1 = even;
    p.f2 = prime;

    std::cout << p.f2() << '\n';    
    return 0;
}